# 1

def f1(x):
    print(x, type(x))
    
    
f1(2 * 4 % 7)
f1(2 * (4 % 7))
f1(51 // 6 % 7)
f1(51 // (6 % 7))
f1((-3 + 5) * (2 % 7 // 3 + 4 * 2))
f1((3 // 5.0) * 20 + 32.0)
f1(float(int(1.56)))
f1(bool(-0.0))
f1(float('inf'))
f1(int(bool(13.56)))

# 2

def f2(v):
    return v % 10


def f2_1(v):
    return v % 2

# 3

print(((10.001 / 9.001) ** 345) * ((13.001 / 11.001) ** 249) / (9.001 ** 10 * 11.001 ** 20))

# 4
print('Виконавець: Мулявка\n            Роман\n            Андрійович\n     Група: К-13(2)')  # 
