Python 3.8.5 (tags/v3.8.5:580fbb0, Jul 20 2020, 15:43:08) [MSC v.1926 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> def f1(x):
	return x,type(x)

>>> f1(2*4%7)
(1, <class 'int'>)
>>> f1(2*(4%7))
(8, <class 'int'>)
>>> f1(51//6%7)
(1, <class 'int'>)
>>> f1(51//(6%7))
(8, <class 'int'>)
>>> f1((-3+5)*(2%7//3+4*2))
(16, <class 'int'>)
>>> f1((3//5.0)*20+32.0)
(32.0, <class 'float'>)
>>> f1(float(int(1.56)))
(1.0, <class 'float'>)
>>> f1(bool(-0.0))
(False, <class 'bool'>)
>>> f1(float('inf'))
(inf, <class 'float'>)
>>> f1(int(bool(13.56)))
(1, <class 'int'>)
>>> def f2(v):
	return v%10

>>> f2(7237632854)
4
>>> f2(173761295135325)
5
>>> def f2_1(v):
	return bin(v),v%2

>>> f2_1(72)
('0b1001000', 0)
>>> f2_1(834718675391)
('0b1100001001011001000111000011000110111111', 1)
>>> ((10.001/9.001)**345)*((13.001/11.001)**249)/(9.001**10*11.001**20)
2997.246914575195
>>> print('''Виконавець: Мулявка
            Роман
            Андрійович
     Група: К-13(2)''')
Виконавець: Мулявка
            Роман
            Андрійович
     Група: К-13(2)
>>> 