def f2(): #9.	Написати функцію, що заповнює вже існуючий список цілими числами з клавіатури. 
    s=list(range(2,20))
    print(s[3:9])


def f6(s):
    print(f'1) {s[:len(s) // 2 + 1 * len(s) % 2]}')  #1)	з першої половини послідовності s (якщо довжина непарна, центральний елемент включати); 
    print(f'2) {s[:len(s) // 2]}') #2)	з першої половини послідовності s (якщо довжина непарна, центральний елемент не включати); 
    print(f'3) {s[:len(s) // 3]}') #
    print(f'4) {s[len(s) // 2:]}') # 4)	з другої половини послідовності s (якщо довжина непарна, центральний елемент включати); 
    print(f'5) {s[len(s) // 2 + 1 * len(s) % 2:]}') #5)	з другої половини послідовності s (якщо довжина непарна, центральний елемент не включати); 
    print(f'6) {s[len(s) // 3:2 * len(s) // 3]}')# 6) з другої третини послідовності s; 
    print(f'7) {s[:10]}') #7)	з перших 10 елементів послідовності s; 
    print(f'8) {list(reversed(s[:10]))}') #8)	з перших 10 елементів послідовності s, записаних в оберненому порядку; 
    print(f'9) {s[2::3]}') # 9)	з кожного третього елемента послідовності; 
    print(f'10) {list(reversed(s[2::3]))}')# 10)	з кожного третього елемента послідовності, записаних в оберненому порядку. 


def f9a(): #9.	Написати функцію, що заповнює вже існуючий список цілими числами з клавіатури. 
    try:
        x = int(input())
    except:
        return False
    else:
        s.append(x)
        return True
    
    
def f9b():
    try:
        x = int(input())
    except:
        s.clear()
        return False
    else:
        s.append(x)
        return True

    
def f17(s): #17.	Написати функцію, що в списку цілих замінює всі від’ємні значення на -1. 
    x=[]
    for i in s:
        if i<0:
            x.append(-1)
        else:
            x.append(i)
    return x #[x if x>=0 else -1 for x in s]


def f19(s): #19.	Написати функцію, що циклічно зсуває список на одну позицію вправо.
    return [s[-1] ] + s[:-1]


def f22(s): # 22.	Написти функцію, що за послідовністю цілих знаходить її найменший додатній елемент. 
    return min([x   for x in s if x>0 ])

#36.	Написати функцію, що перевіряє чи складаються дві послідовності з однакових елементів з точністю до кількості входжень кожного елемента в послідовність. 
#Порядок елементів у послідовності несуттєвий. 
def f36(a,b):
    if len(a) != len(b):
        return False
    for i in a:
        if not (i in b):
              return False
        else:
            while i in a:
                a.remove(i)
            while i in b:
                b.remove(i)
            if len(a) != len(b):
                return False
    return True
