"""
Домашнє завдання 4(від 16.10.2020)
1) Зробити дз1,дз2,дз3, самостійну
2) короновірус, бот в телеграмі (Lab_k13-2/Y_Serhii/sam1-surname.py)
3) codewar 25 solutions , або leetcode та сама кілкість. лінк на профіль - на гітхаб в файл DZ-3.py
4) Саме ДЗ 4 офіційне (внизу цього документу)


# _________________________________________________


#ДЗ 4

1. Написати функцію, що за прізвищем та ім’ям друкує персональне вітання.
        Написати програму, яка запитує в користувача прізвище та ім’я,
        а потім друкує для нього персональне вітання.
        Функція має запобігати плутанині аргументів.
2. Записати умову того, що значення змінних x, y, z попарно різні.


3. Написати функцію, яка перевіряє, що два дійсних значення рівні з точністю
до епсілон
            Для epsilon в якості значення за умовчанням використати 10^−10

4. Написати функцію, що за коефіцієнтами двох прямих площини повертає ознаку того,
що прямі коллінеарні.
Пряма задається коефіцієнтами a, b, c рівняння ax + by + c = 0. 5. Все закомітити на Гіт
Увага! У жодній із задач ключове слово if виникати не повинно.
Hint: у п.4 має бути більше однієї функції, що спільно розв'язують задачу.

"""
