"""
Домашнє завдання (від 23.10.2020)

    1) codewars 25+ solutions.
далі:
	Записати функцію, що повертає ознаку того, що рядок складається рівно з однієї літери, яка є шістнадцятковою цифрою.
	Написати функцію з числовим параметром x, яка повертає  1, 0, 1, відповідно, якщо x  0, x = 0, x  0.
	Написати функцію, яка за коефіцієнтами a, b, c рівняння ax^2  + bx + c=0 повертає кількість його дійсних розв’язків. (Якщо розв’язків нескінченно багато, повертає -1.)
	Написати функцію, що задає умову того, що прямокутну цеглину з довжинами ребер a, b, c можна просунути в прямокутне вікно x на y так, щоб її грані були паралельні сторонам вікна. Цеглину можна повертати.
Функцію задокументувати та протестувати. (Тести можна зробити hardcoded  окремою функцією.)
	Написати функцію, яка за заданим цілим числом, що задає вік людини, визначає яке зі слів «рік», «роки», «років» треба до нього приписати відповідно до правил української граматики. Наприклад, 21 рік, 34 роки, 14 років.

 Викласти на гіт.


"""
