"""
1) Створити у своїму каталозі на гіт SAM-Surname.py
2) Написати програму, яка за довжинами сторін трикутника обчислює його периметр.
            Вхідні значення вважати коректними.
3) Дано три числа. Написати "yes", якщо можно взяти які небудь два з них та в сумі отримати третє
4) Користувач вводить чотири числа – знайти найбільше Парне з них. Якщо воно не існує вивести фразу «not found»

5) Написати програму, яка запитує в користувача координати точки дійсної площини, а потім виводить отриману точку. Зверніть увагу на зовнішній вигляд друкованого результату

6)  Дано ціле число k , 1<k<180
Та послідовність цифр
10111213...9899
В якіф записані підряд УСІ Двузначні числа ,. Знайти K-ту цифру цій послідовності

7)   Знайти суми (cos згідно фото )


11) Перевірити, чи усі числа в послідовності унікальні.

12) Змініть значення зміних місцями (x , y) Наведіть ще мінімум два способи
>>> x=3
>>> y=5
>>> temp=x
>>> x=y
>>> y=temp
>>> x,y
(5, 3)

(2й спосіб не використовуя temp через віднімання додавання x,y ) (3й способ використовуя синтаксис мови пайтон)
"""

# _________________________________________________
  """
      Coronovirus:
номер 10:
в терминале
pip install requests (возможно pip3 install requests) pip install bs4

 запустити coronavirus.py (файл в телеграмі)
#!/usr/bin/env python3


Переробити програму, вивести статистику по державі, назва якої починається з першої літери вашого прізвища
"""


  # _________________________________________________
"""

  2) Bot Telegram
   В телеграмі знайдіть
...@BotFather
/start
/newbot (назва , коротке посилання вигадайте)
Отримайте токен (червона строка ) Далі в терміналі

 pip install pytelegrambotapi
завантажте файл telegramTest.py
змініть YOURS_TOKEN_HERE на ваш токен запустите.
botfather у повідомленні з токеном прийшле лінк на бот скиньте лінк на бот в чат телеграмі, і на гіт.
Код зі своїм токеном на гіт не виставляйте – тільки замінючи токен.
Якщо виставили нічого страшного – можна швиденько в ботфазері скинути. Але хтось може встигнути і розіслати повідомлення по базі вашого бота.
До бота додати якусь кльову фукнцію .наприклад користувая вводить якесь слово – бот знаходить вірш ( зберігати можно просто в коді програми у list string.
"""
