"""
Для розігріву:

1. Змінні. Присвоювання. Складені присвоювання.
Чому дорівнюють значення змінних x, y за виконання такої послідовності інструкцій?
x = 1
y = 2.5
y = x
x = 3
x += x
2. Присвоювання списку. 
Чому дорівнюють значення змінних x та y за виконання такої послідовності інструкцій?
x, y = 1, 2
x, y, y, x = y, x, 3, y
3. Написати програму, що обчислює значення виразу  .(x+y)/(X2+Y2+1)
де X2,Y2- піднесення у другу степінь.

4. Попередня задача, але результат має виводитись у форматі з фіксованою крапкою з 3 символами після крапки.

5. Написати програму, яка запитує в користувача години та хвилини, а потім виводить час у форматі
 hh:mm (наприклад, 08:40).

6. Засоби модуля math
Імпортування, використання.

Знайти значення π, e, tg(π), tg(π/2)

*********************
ОСНОВНЕ



Домашнє завдання (від 09.10.2020)
1. Змінні year, month, day позначають рік, місяць, день. Записати f-рядок, значенням якого є відповідна дата у форматі dd.mm.yy (наприклад, 01.01.21). Написати програму, що запитує в користувача відповідні значення і у відповідь виводить значення f-рядка.
Скласти тестові приклади та протестувати програму на цих даних.
2.Написати програму, що обчислює значення ctg(x+y). Дані вводить користувач. Результат вивести в експоненційному форматі з 2 знаками після крапки.
3.Написати програму, що обчислює значення arcctg(x). Дані вводить користувач. Результат вивести у форматі з фіксованою крапкою з 4 знаками після крапки.
4.За допомогою функцій exp, log бібліотеки math обчислити значення  249
10.001^345 * 13.001^249 / ( 9.001 ^ 355 *11.001^269) 
виразу. Порівняти зі значенням, отриманим до цього.

5. На гіт все коміт. Додайте коментар до коду,   вираз з п.1 та його значення (безпосередньо в коді), а також тестові приклади, на яких відбувалось тестування програми. що буде якщо юзер введе 32й день? що буде якщо введе 30 лютого? що буде якщо введе 29 лютого 2021 року? 

*********************
 З зірочкою 
 1) Імпортуйте time  і порахуйте скільки секунд пройшло з початку вашего Навчання в КНУ, і скільки залишилось.
 І секундах, хвилинах, днях, тижнях. 
 
 2) Для нашого дробу 10.001^345 .... для обчислення зробіть різні фукнції, обчисліть час виконання їх за допомогою тайм іт 
 >>> import timeit
>>> timeit.timeit("f(10)", globals=globals())
1.063997201999996

>>> timeit.timeit("g(10)", globals=globals())
1.815312818999928


"""
