
"""
Домашнє завдання (від 25.09.2020)
1. Встановити інтерпретатор Python (див. файл 1...pdf, підрозділ 1.7).
2. Запустити інтерпретатор з командного рядка.
3. Використовуючи інтерпретатор мови Python, знайти значення (12345)8, (FAFBCD)16.
4. Указати значення виразів мови Python та їх тип:
а) 9/5, (-9)/5, 9/(-5), (-9)/(-5);
б) 9//5, (-9)//5, 9//(-5), (-9)//(-5); в) 9%5, (-9)%5, 9%(-5), (-9)%(-5);
г) 9.0/5.0, 9.0//5.0, 1.5//0.75.

5. Запустити IDLE. За допомогою IDLE (та інтерпретатора) перевірити правильність виконання п.4.
6. Записати вирази для обчислення значень а) √2; б) 3^1.5
За допомогою інтерпретатора переконатися, що вони записані синтаксично правильно та обчислюють саме те, що треба (= протестувати записані вирази).
(√2 = 1.41......, 3^1.5 = 5.19.....)
7. Викласти у свою папку на гіт код та скопіювати результати обчислень у цей файл, додати як коммент (""" результат """ )
8. Встановити IDE.
9. Запустити встановлене IDE, ознайомитись з його виглядом.
10. В інтерпретаторі набрати рядок
#import this
#натиснути ENTER та прочитати, що напише інтерпретатор.
"""
