"""
Домашнє завдання (від 02.10.2020)
1. Указати значення виразів мови Python та їх тип:
2*4%7, 2*(4%7), 51//6%7, 51//(6%7),
(-3+5)*(2%7//3+4*2), (3//5.0)*20+32.0
float(int(1.56)), bool(-0.0), float('inf'), int(bool(13.56))

2. Нехай v — ім’я цілої змінної з невід’ємним значенням. Написати вираз, який задає обчислення:
а) значення молодшої десяткової цифри числа v; б) значення молодшої двійкової цифри числа v.
3. Записати вираз для обчислення значення 10.001^ 345 *13.001^249 / (9.001^355 * 11.001^269) де ^ - піднесення в степінь (а в пайтоні ^ - це xor https://python-reference.readthedocs.io/en/latest/docs/operators/bitwise_XOR.html) 
. Виконати обчислення в інтерпретаторі. (Або можна написати та виконати програму, що виводить потрібне значення. Головне – це значення отримати.)
4. Написати програму з однієї інструкції, що виводить текст
Виконавець: прізвище
            ім’я
            по-батькові 
     Група: К-хх(y)
Замість ПІБ, хх, y підставити власну інформацію. Кількість пропусків має бути відповідна до завдання.
Hint: необхідний текст можна записати одним літералом у трикратних лапках.
Обов’язково перевірити, чи красиво виводиться інформація (тобто чи правильно задані пропуски).
5.  загрузити на гіт, в код комментом додати результат виконання коду. 
"""
